balazsgrill/modembed/res/Devices/16xxxx/PIC16F627.PIC
<?xml version="1.0" ?><edc:PIC edc:arch="16xxxx" edc:desc="" edc:dsid="40300" edc:informedby="DOS PS DS" edc:isextended="false" edc:name="PIC16F627" edc:procid="0x6627" xmlns:edc="http://crownking/edc" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd">
  <edc:Import>
    <edc:Module_import edc:modsrc="16xxxx-NMMR.Module"/>
  </edc:Import>
  <edc:Power>
    <edc:VPP edc:defaultvoltage="13.000" edc:maxvoltage="13.250" edc:minvoltage="12.750"/>
    <edc:VDD edc:maxdefaultvoltage="5.500" edc:maxvoltage="5.500" edc:mindefaultvoltage="3.000" edc:minvoltage="2.500" edc:nominalvoltage="5.000"/>
  </edc:Power>
  <edc:Programming edc:erasealgo="9" edc:hasrowerasecmd="false" edc:hasvppfirst="true" edc:lvpthresh="4.500" edc:memtech="ee" edc:tries="1">
    <edc:Wait edc:cfg="8000" edc:eedata="8000" edc:erase="5000" edc:pgm="8000" edc:userid="8000"/>
    <edc:Latches edc:cfg="1" edc:eedata="1" edc:pgm="1" edc:userid="1"/>
  </edc:Programming>
  <edc:ArchDef edc:desc="16xxxx" edc:name="16xxxx">
    <edc:MemTraits edc:hwstackdepth="8">
      <edc:CodeMemTraits edc:locsize="0x1" edc:wordimpl="0x3fff" edc:wordinit="0x3fff" edc:wordsafe="0x3fff" edc:wordsize="0x2"/>
      <edc:CalDataMemTraits edc:locsize="0x1" edc:wordimpl="0x3fff" edc:wordinit="0x3fff" edc:wordsafe="0x3fff" edc:wordsize="0x2"/>
      <edc:BackgroundDebugMemTraits edc:locsize="0x1" edc:wordimpl="0x3fff" edc:wordinit="0x3fff" edc:wordsafe="0x3fff" edc:wordsize="0x2"/>
      <edc:TestMemTraits edc:locsize="0x1" edc:wordimpl="0x3fff" edc:wordinit="0x3fff" edc:wordsafe="0x3fff" edc:wordsize="0x2"/>
      <edc:UserIDMemTraits edc:locsize="0x1" edc:wordimpl="0x7f" edc:wordinit="0x3fff" edc:wordsafe="0x7f" edc:wordsize="0x2"/>
      <edc:ConfigFuseMemTraits edc:locsize="0x2" edc:unimplval="0" edc:wordimpl="0x3fff" edc:wordinit="0x3fff" edc:wordsafe="0x3fff" edc:wordsize="0x2"/>
      <edc:DeviceIDMemTraits edc:locsize="0x1" edc:wordimpl="0x3fff" edc:wordinit="0x3fff" edc:wordsafe="0x3fff" edc:wordsize="0x2"/>
      <edc:EEDataMemTraits edc:magicoffset="0x2100"/>
      <edc:DataMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0x0" edc:wordsafe="0xff" edc:wordsize="0x1"/>
    </edc:MemTraits>
  </edc:ArchDef>
  <edc:Breakpoints edc:hasdatacapture="false" edc:hwbpcount="1" edc:idbyte="x"/>
  <edc:ProgramSpace>
    <edc:CodeSector edc:beginaddr="0x0" edc:endaddr="0x400" edc:issection="true" edc:regionid="page" edc:sectiondesc="ROM code space" edc:sectionname="PROG"/>
    <edc:TestZone edc:beginaddr="0x2000" edc:endaddr="0x2010" edc:regionid="testmem"/>
    <edc:UserIDSector edc:beginaddr="0x2000" edc:endaddr="0x2004" edc:issection="true" edc:regionid=".idlocs" edc:sectiondesc="ID locations" edc:sectionname="IDLOCS"/>
    <edc:DeviceIDSector edc:beginaddr="0x2006" edc:endaddr="0x2007" edc:mask="0x3fe0" edc:regionid="devid" edc:value="0x7a0"/>
    <edc:ConfigFuseSector edc:beginaddr="0x2007" edc:endaddr="0x2008" edc:regionid=".config">
      <edc:DCRDef edc:access="--nnnn-nnnnnnnnn" edc:cname="CONFIG" edc:default="0xffff" edc:desc="" edc:impl="0x3dff" edc:name="CONFIG" edc:nzwidth="0x10" edc:unimplval="1" edc:unused="0x200" edc:useinchecksum="0x3dff">
        <edc:AliasList/>
        <edc:Illegal edc:desc="Current settings of PWRT and BOD are in conflict" edc:when="(reg &amp; 0x40) == 0x40"/>
        <edc:Illegal edc:desc="Current settings of PWRT and BOD are in conflict" edc:when="(reg &amp; 0x8) == 0x8"/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="FOSC" edc:desc="Oscillator Selection bits" edc:mask="0x13" edc:name="FOSC" edc:nzwidth="0x5">
              <edc:DCRFieldSemantic edc:cname="ERCLK" edc:desc="ER oscillator: CLKOUT function on RA6/OSC2/CLKOUT pin, Resistor on RA7/OSC1/CLKIN" edc:when="(field &amp; 0x13) == 0x13">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_ER_OSC_CLKOUT"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ERIO" edc:desc="ER oscillator: I/O function on RA6/OSC2/CLKOUT pin, Resistor on RA7/OSC1/CLKIN" edc:when="(field &amp; 0x13) == 0x12">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_ER_OSC_NOCLKOUT"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="INTOSCCLK" edc:desc="INTRC oscillator: CLKOUT function on RA6/OSC2/CLKOUT pin, I/O function on RA7/OSC1/CLKIN" edc:when="(field &amp; 0x13) == 0x11">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_INTRC_OSC_CLKOUT"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="INTOSCIO" edc:desc="INTRC oscillator: I/O function on RA6/OSC2/CLKOUT pin, I/O function on RA7/OSC1/CLKIN" edc:when="(field &amp; 0x13) == 0x10">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_INTRC_OSC_NOCLKOUT"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ECIO" edc:desc="EC: I/O function on RA6/OSC2/CLKOUT pin, CLKIN on RA7/OSC1/CLKIN" edc:when="(field &amp; 0x13) == 0x3">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_EXTCLK_OSC"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="HS" edc:desc="HS oscillator: High-speed crystal/resonator on RA6/OSC2/CLKOUT and RA7/OSC1/CLKIN" edc:when="(field &amp; 0x13) == 0x2">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_HS_OSC"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="XT" edc:desc="XT oscillator: Crystal/resonator on RA6/OSC2/CLKOUT and RA7/OSC1/CLKIN" edc:when="(field &amp; 0x13) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_XT_OSC"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="LP" edc:desc="LP oscillator: Low-power crystal on RA6/OSC2/CLKOUT and RA7/OSC1/CLKIN" edc:when="(field &amp; 0x13) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_LP_OSC"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="-3"/>
            <edc:DCRFieldDef edc:cname="WDTE" edc:desc="Watchdog Timer Enable bit" edc:mask="0x1" edc:name="WDTE" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="WDT enabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_WDT_ON"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="WDT disabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_WDT_OFF"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="PWRTE" edc:desc="Power-up Timer Enable bit" edc:mask="0x1" edc:name="PWRTE" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="PWRT disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="PWRT enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="MCLRE" edc:desc="RA5/MCLR pin function select" edc:mask="0x1" edc:name="MCLRE" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="RA5/MCLR pin function is MCLR" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="RA5/MCLR pin function is digital input, MCLR internally tied to VDD" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BOREN" edc:desc="Brown-out Reset Enable bit" edc:mask="0x1" edc:name="BOREN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="BOD Reset enabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_BODEN_ON"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="BOD Reset disabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_BODEN_OFF"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LVP" edc:desc="Low-Voltage Programming Enable bit" edc:mask="0x1" edc:name="LVP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="RB4/PGM pin has PGM function, low-voltage programming enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="RB4/PGM pin has digital I/O function, HV on MCLR must be used for programming" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="CPD" edc:desc="Data Code Protection bit" edc:mask="0x1" edc:name="CPD" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Data memory code protection off" edc:when="(field &amp; 0x1) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="DATA_CP_OFF"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Data memory code protected" edc:when="(field &amp; 0x1) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="DATA_CP_ON"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="CP" edc:desc="Code Protection bits" edc:mask="0xf" edc:name="CP" edc:nzwidth="0x4">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Program memory code protection off" edc:when="(field &amp; 0xf) == 0xf">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="50" edc:desc="Program memory code protection off" edc:when="(field &amp; 0xf) == 0xa">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="75" edc:desc="0200h-03FFh code protected" edc:when="(field &amp; 0xf) == 0x5">
                <edc:Checksum edc:beginaddr="0x200" edc:checksumalgo="0x20" edc:endaddr="0x400"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ALL" edc:desc="0000h-03FFh code protected" edc:when="(field &amp; 0xf) == 0x0">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x20" edc:endaddr="0x400"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:EEDataSector edc:beginaddr="0x2100" edc:endaddr="0x2180" edc:issection="true" edc:regionid="eedata" edc:sectiondesc="Data EEPROM" edc:sectionname="DEEPROM"/>
  </edc:ProgramSpace>
  <edc:DataSpace edc:endaddr="0x200">
    <edc:RegardlessOfMode>
      <edc:NMMRPlace edc:regionid="corenmmrs">
        <edc:Module_ref edc:modsrc="16xxxx-NMMR.Module"/>
      </edc:NMMRPlace>
      <edc:SFRDataSector edc:bank="0" edc:beginaddr="0x0" edc:endaddr="0x20" edc:regionid="sfr0">
        <edc:SFRDef edc:access="--------" edc:cname="INDF" edc:desc="" edc:impl="0x0" edc:isindirect="true" edc:isvolatile="false" edc:mclr="--------" edc:name="INDF" edc:nzwidth="0x8" edc:por="--------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INDF" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="INDF" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR0" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR0" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TMR0" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
