balazsgrill/modembed/res/Devices/16xxxx/PIC16F627.PIC
        <edc:AdjustPoint edc:offset="3"/>
        <edc:Mirror edc:nzsize="0x2" edc:regionidref="sfr0"/>
        <edc:SFRDef edc:access="nnnn-nnn" edc:cname="PIE1" edc:desc="" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000" edc:name="PIE1" edc:nzwidth="0x8" edc:por="0000-000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR1IE" edc:desc="" edc:mask="0x1" edc:name="TMR1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR2IE" edc:desc="" edc:mask="0x1" edc:name="TMR2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1IE" edc:desc="" edc:mask="0x1" edc:name="CCP1IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TXIE" edc:desc="" edc:mask="0x1" edc:name="TXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RCIE" edc:desc="" edc:mask="0x1" edc:name="RCIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMIE" edc:desc="" edc:mask="0x1" edc:name="CMIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EEIE" edc:desc="" edc:mask="0x1" edc:name="EEIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:SFRDef edc:access="----n-nn" edc:cname="PCON" edc:desc="" edc:impl="0xb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----1-uq" edc:name="PCON" edc:nzwidth="0x8" edc:por="----1-0x">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="nBOR" edc:desc="" edc:mask="0x1" edc:name="nBOR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nPOR" edc:desc="" edc:mask="0x1" edc:name="nPOR" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OSCF" edc:desc="" edc:mask="0x1" edc:name="OSCF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="nBO" edc:desc="" edc:mask="0x1" edc:name="nBO" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="nBOD" edc:desc="" edc:mask="0x1" edc:name="nBOD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="3"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PR2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="PR2" edc:nzwidth="0x8" edc:por="11111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR2" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="PR2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="5"/>
        <edc:SFRDef edc:access="nnnn-nrn" edc:cname="TXSTA" edc:desc="" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-010" edc:name="TXSTA" edc:nzwidth="0x8" edc:por="0000-010">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TX9D" edc:desc="" edc:mask="0x1" edc:name="TX9D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRMT" edc:desc="" edc:mask="0x1" edc:name="TRMT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BRGH" edc:desc="" edc:mask="0x1" edc:name="BRGH" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SYNC" edc:desc="" edc:mask="0x1" edc:name="SYNC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXEN" edc:desc="" edc:mask="0x1" edc:name="TXEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX9" edc:desc="" edc:mask="0x1" edc:name="TX9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSRC" edc:desc="" edc:mask="0x1" edc:name="CSRC" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SPBRG" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SPBRG" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPBRG" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="SPBRG" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="EEDATA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="EEDATA" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EEDATA" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="EEDATA" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="EEADR" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="EEADR" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EEADR" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="EEADR" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnss" edc:cname="EECON1" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----q000" edc:name="EECON1" edc:nzwidth="0x8" edc:por="----x000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RD" edc:desc="" edc:mask="0x1" edc:name="RD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WR" edc:desc="" edc:mask="0x1" edc:name="WR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WREN" edc:desc="" edc:mask="0x1" edc:name="WREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WRERR" edc:desc="" edc:mask="0x1" edc:name="WRERR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="wwwwwwww" edc:cname="EECON2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------" edc:name="EECON2" edc:nzwidth="0x8" edc:por="--------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EECON2" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="EECON2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:SFRDef edc:access="nnn-nnnn" edc:cname="VRCON" edc:desc="" edc:impl="0xef" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-0000" edc:name="VRCON" edc:nzwidth="0x8" edc:por="000-0000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="VR" edc:desc="" edc:mask="0xf" edc:name="VR" edc:nzwidth="0x4"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="VRR" edc:desc="" edc:mask="0x1" edc:name="VRR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VROE" edc:desc="" edc:mask="0x1" edc:name="VROE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VREN" edc:desc="" edc:mask="0x1" edc:name="VREN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="VR0" edc:desc="" edc:mask="0x1" edc:name="VR0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VR1" edc:desc="" edc:mask="0x1" edc:name="VR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VR2" edc:desc="" edc:mask="0x1" edc:name="VR2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VR3" edc:desc="" edc:mask="0x1" edc:name="VR3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="2" edc:beginaddr="0x100" edc:endaddr="0x120" edc:regionid="sfr2">
        <edc:Mirror edc:nzsize="0x1" edc:regionidref="sfr0"/>
        <edc:Mirror edc:nzsize="0x1" edc:regionidref="sfr0"/>
        <edc:Mirror edc:nzsize="0x3" edc:regionidref="sfr0"/>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:Mirror edc:nzsize="0x1" edc:regionidref="sfr0"/>
        <edc:AdjustPoint edc:offset="3"/>
        <edc:Mirror edc:nzsize="0x2" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="3" edc:beginaddr="0x180" edc:endaddr="0x1a0" edc:regionid="sfr3">
        <edc:Mirror edc:nzsize="0x1" edc:regionidref="sfr0"/>
        <edc:Mirror edc:nzsize="0x1" edc:regionidref="sfr1"/>
        <edc:Mirror edc:nzsize="0x3" edc:regionidref="sfr0"/>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:Mirror edc:nzsize="0x1" edc:regionidref="sfr1"/>
        <edc:AdjustPoint edc:offset="3"/>
        <edc:Mirror edc:nzsize="0x2" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:GPRDataSector edc:bank="0" edc:beginaddr="0x20" edc:endaddr="0x70" edc:regionid="gpr0"/>
      <edc:GPRDataSector edc:bank="0" edc:beginaddr="0x70" edc:endaddr="0x80" edc:regionid="gprnobnk"/>
      <edc:GPRDataSector edc:bank="1" edc:beginaddr="0xa0" edc:endaddr="0xf0" edc:regionid="gpr1"/>
      <edc:GPRDataSector edc:bank="1" edc:beginaddr="0xf0" edc:endaddr="0x100" edc:regionid="gpr1s" edc:shadowidref="gprnobnk"/>
      <edc:GPRDataSector edc:bank="2" edc:beginaddr="0x120" edc:endaddr="0x150" edc:regionid="gpr2"/>
      <edc:GPRDataSector edc:bank="2" edc:beginaddr="0x170" edc:endaddr="0x180" edc:regionid="gpr2s" edc:shadowidref="gprnobnk"/>
      <edc:GPRDataSector edc:bank="3" edc:beginaddr="0x1f0" edc:endaddr="0x200" edc:regionid="gpr3" edc:shadowidref="gprnobnk"/>
    </edc:RegardlessOfMode>
    <edc:TraditionalModeOnly/>
    <edc:ExtendedModeOnly/>
  </edc:DataSpace>
  <edc:PinList>
    <edc:Pin>
      <!--Pin 1-->
      <edc:VirtualPin edc:name="RA2"/>
      <edc:VirtualPin edc:name="AN2"/>
      <edc:VirtualPin edc:name="Vref"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 2-->
      <edc:VirtualPin edc:name="RA3"/>
      <edc:VirtualPin edc:name="AN3"/>
      <edc:VirtualPin edc:name="CMP1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 3-->
      <edc:VirtualPin edc:name="RA4"/>
      <edc:VirtualPin edc:name="T0CKI"/>
      <edc:VirtualPin edc:name="CMP2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 4-->
      <edc:VirtualPin edc:name="RA5"/>
      <edc:VirtualPin edc:name="MCLR"/>
      <edc:VirtualPin edc:name="Vpp"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 5-->
      <edc:VirtualPin edc:name="Vss"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 6-->
      <edc:VirtualPin edc:name="RB0"/>
      <edc:VirtualPin edc:name="INT"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 7-->
      <edc:VirtualPin edc:name="RB1"/>
      <edc:VirtualPin edc:name="RX"/>
      <edc:VirtualPin edc:name="DT"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 8-->
      <edc:VirtualPin edc:name="RB2"/>
      <edc:VirtualPin edc:name="TX"/>
      <edc:VirtualPin edc:name="CK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 9-->
      <edc:VirtualPin edc:name="RB3"/>
      <edc:VirtualPin edc:name="CCP1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 10-->
      <edc:VirtualPin edc:name="RB4"/>
      <edc:VirtualPin edc:name="PGM"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 11-->
      <edc:VirtualPin edc:name="RB5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 12-->
      <edc:VirtualPin edc:name="RB6"/>
      <edc:VirtualPin edc:name="T1OSO"/>
      <edc:VirtualPin edc:name="T1CKI"/>
      <edc:VirtualPin edc:name="PGC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 13-->
      <edc:VirtualPin edc:name="RB7"/>
      <edc:VirtualPin edc:name="T1OSI"/>
      <edc:VirtualPin edc:name="PGD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 14-->
      <edc:VirtualPin edc:name="Vdd"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 15-->
      <edc:VirtualPin edc:name="RA6"/>
      <edc:VirtualPin edc:name="OSC2"/>
      <edc:VirtualPin edc:name="CLKOUT"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 16-->
      <edc:VirtualPin edc:name="RA7"/>
      <edc:VirtualPin edc:name="OSC1"/>
      <edc:VirtualPin edc:name="CLKIN"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 17-->
      <edc:VirtualPin edc:name="RA0"/>
      <edc:VirtualPin edc:name="AN0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 18-->
      <edc:VirtualPin edc:name="RA1"/>
      <edc:VirtualPin edc:name="AN1"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>